# RbsReferenceOverallsize Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsReferenceOverallsize Property
ParameterTypeId Class See Also
---
"Overall Size"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsReferenceOverallsize { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsReferenceOverallsize As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsReferenceOverallsize {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace